// Ванесса.ДобавитьШагВМассивТестов(ВсеТесты, "Fake()", "Fake", "И ложный шаг", "", "");
&НаКлиенте
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	ВсеТесты = Новый Массив;
	ИмяПроцедуры = "ОткрытьКарточку";
	Начало = "И я открываю ";
	Представление = Начало + ("""Имя"" для " + """Роль""");
	Описание = "Открывает ""особую"" карточку.";
	ТекстСЛожнымВызовом = "Ванесса.ДобавитьШагВМассивТестов(ВсеТесты, ""это строка"")";

	Ванесса.ДобавитьШагВМассивТестов(
		ВсеТесты[ПолучитьИндекс(1, 2)],
		"ОткрытьКарточку(Знач Имя, Роль)",
		ИмяПроцедуры,
		Представление,
		Описание,
		"UI");

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты, "БезРеализации()", "БезРеализации", "И шаг без реализации", "", "");

	Возврат ВсеТесты;
КонецФункции

&НаКлиенте
Процедура ОткрытьКарточку(Имя, Роль) Экспорт
	Сообщить(Имя + " / " + Роль);
КонецПроцедуры
