// Учебный исходник. Для выполнения необходима собранная обработка Vanessa.
Функция ПолучитьСписокТестов(Контекст) Экспорт
    ВсеТесты = Новый Массив;
    Контекст.ДобавитьШагВМассивТестов(ВсеТесты, "ЯПоказываюУчебноеСообщение()", "ЯПоказываюУчебноеСообщение", "И я показываю учебное сообщение", "Выводит сообщение без изменения данных базы.", "Учебная мастерская");
    Возврат ВсеТесты;
КонецФункции

Процедура ЯПоказываюУчебноеСообщение(ЗначениеПараметра = "") Экспорт
    Сообщить(ЗначениеПараметра);
КонецПроцедуры
