// Учебный исходник. Для выполнения необходима собранная обработка Vanessa.
&НаКлиенте
Перем Контекст Экспорт;
&НаКлиенте
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
    ВсеТесты = Новый Массив;
    КонтекстФреймворкаBDD.ДобавитьШагВМассивТестов(ВсеТесты, "ЯПоказываюУчебноеСообщение()", "ЯПоказываюУчебноеСообщение", "И я показываю учебное сообщение", "Выводит сообщение без изменения данных базы.", "Учебная мастерская");
    Возврат ВсеТесты;
КонецФункции

&НаКлиенте
Процедура ЯПоказываюУчебноеСообщение() Экспорт
    Сообщить("Учебное сообщение");
КонецПроцедуры
